constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet1
    {
        type            patch;
        nFaces          160;
        startFace       45225;
    }
    outlet1
    {
        type            patch;
        nFaces          80;
        startFace       45385;
    }
    outlet2
    {
        type            patch;
        nFaces          80;
        startFace       45465;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          20;
        startFace       45545;
    }
    top
    {
        type            patch;
        nFaces          130;
        startFace       45565;
    }
    wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       45695;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          45600;
        startFace       45975;
    }
)

// ************************************************************************* //
