0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet1
    {
    type                    freestream;
    freestreamValue         uniform 300;
    value                   uniform 300;
    }
    

    outlet1
    {
        type            zeroGradient;
    }

    outlet2
    {
        type            zeroGradient;
    }

    wall1
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    
    bottom
    {
        type            symmetryPlane;
    }
    

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
